cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/php'
tap 'koekeishiya/kwm'
tap 'neovim/neovim'


# Tools
brew 'ack'
brew 'awscli'
brew 'awsebcli'
brew 'composer'
brew 'coreutils'
brew 'dnsmasq'
brew 'ffmpeg', args: ['with-libvpx']
brew 'git'
brew 'git-extras'
brew 'go'
brew 'grc'
brew 'keybase'
brew 'koekeishiya/kwm/kwm', restart_service: :changed
brew 'kops'
brew 'libvpx'
brew 'mackup'
brew 'neovim/neovim/neovim'
brew 'node'
brew 'ocaml'
brew 'opam'
brew 'openssl'
brew 'php71'
brew 'php-version'
brew 'tig'
brew 'tmux'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'


# Apps
cask 'charles'
cask 'dashlane'
cask 'discord-ptb'
cask 'docker'
cask 'dropbox'
cask 'droplr'
cask 'firefoxdeveloperedition'
cask 'google-chrome-dev'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'gpgtools'
cask 'handbrake'
cask 'hazel'
cask 'imageoptim'
cask 'irccloud'
cask 'iterm2-beta'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'mpv'
cask 'ngrok'
cask 'shimo'
cask 'sketch'
cask 'skype'
cask 'slack-beta'
cask 'sublime-text-dev'
cask 'synergy'
cask 'ubersicht'
cask 'visual-studio-code-insiders'
cask 'vlc'


# Mac App Store
mas 'DaisyDisk', id: 411643860
mas 'Irvue', id: 1039633667
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541



# Fonts
cask 'font-fira-code'
cask 'font-source-code-pro'
