cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
#tap 'homebrew/php'
tap 'jmhobbs/parrot'
tap 'koekeishiya/formulae'
tap 'neovim/neovim'


# Tools
brew 'ack'
brew 'awscli'
brew 'awsebcli'
# brew 'brew-php-switcher'
brew 'byobu'
brew 'cmake'
brew 'composer'
brew 'consul'
brew 'coreutils'
brew 'dnsmasq'
brew 'exercism'
brew 'ffmpeg', args: ['with-libvpx']
brew 'git'
brew 'git-extras'
brew 'glide'
brew 'go'
brew 'grc'
brew 'htop'
brew 'hyper'
brew 'imagemagick'
brew 'koekeishiya/formulae/kwm', restart_service: :changed
brew 'kops'
brew 'libvpx'
#brew 'libxml2@2.7'
brew 'mackup'
brew 'mosh'
brew 'mtr'
brew 'mysql'
brew 'neovim/neovim/neovim'
brew 'node'
brew 'nomad'
brew 'ocaml'
brew 'opam'
brew 'openssl'
brew 'phantomjs'
brew 'php@7.0'
brew 'php@7.1'
brew 'redis'
brew 'rbenv'
brew 'terminal-parrot'
brew 'tig'
brew 'tmux'
brew 'tmux-cssh'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'watch'
brew 'zsh'
brew 'zsh-completions'


# Ops-y stuff.
brew 'terraform'


# Apps
cask 'android-platform-tools'
cask 'android-studio'
cask 'arq'
cask 'battle-net'
cask 'charles'
cask 'dash'
cask 'discord-ptb'
cask 'docker'
cask 'dropbox'
cask 'droplr'
cask 'duet'
# cask 'firefoxdeveloperedition'
# cask 'flash-npapi'
# cask 'flash-ppapi'
cask 'flux'
cask 'google-chrome-dev'
cask 'google-cloud-sdk'
cask 'google-drive-file-stream'
cask 'gpg-suite'
cask 'grammarly'
cask 'graphiql'
cask 'handbrake'
cask 'hazel'
cask 'imageoptim'
cask 'irccloud'
# cask 'iswiff'
cask 'iterm2-beta'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'jetbrains-toolbox'
cask 'keka'
cask 'kextviewr'
cask 'keybase'
cask 'minikube'
cask 'mpv'
cask 'mysqlworkbench'
cask 'ngrok'
cask 'nosleep'
cask 'oversight'
cask 'plex-media-player'
cask 'postman'
cask 'rescuetime'
cask 'shimo'
cask 'sketch'
cask 'skype'
cask 'slack-beta'
cask 'spotify'
cask 'sublime-text-dev'
cask 'synergy'
cask 'ubersicht'
cask 'vagrant'
cask 'visual-studio-code-insiders'
cask 'virtualbox'
cask 'vlc'
cask 'vmware-fusion'


# Mac App Store
mas 'Bear', id: 1091189122
mas 'DaisyDisk', id: 411643860
mas 'Irvue', id: 1039633667
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Marked', id: 890031187
mas 'Mountain Duck', id: 1024974133
mas 'Pages', id: 409201541
mas 'Pixelmator', id: 407963104
mas 'Trello', id: 1278508951


# Fonts
cask 'font-fira-code'
cask 'font-overpass'
cask 'font-roboto-slab'
cask 'font-source-code-pro'
