cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/php'
tap 'jmhobbs/parrot'
tap 'koekeishiya/kwm'
tap 'neovim/neovim'


# Tools
brew 'ack'
brew 'android-platform-tools'
brew 'awscli'
brew 'awsebcli'
brew 'byobu'
brew 'composer'
brew 'coreutils'
brew 'dnsmasq'
brew 'ffmpeg', args: ['with-libvpx']
brew 'git'
brew 'git-extras'
brew 'go'
brew 'grc'
brew 'hyper'
brew 'imagemagick'
brew 'keybase'
brew 'koekeishiya/kwm/kwm', restart_service: :changed
brew 'kops'
brew 'libvpx'
brew 'libxml2@2.7'
brew 'mackup'
brew 'mosh'
brew 'mtr'
brew 'neovim/neovim/neovim'
brew 'node'
brew 'ocaml'
brew 'opam'
brew 'openssl'
brew 'phantomjs'
brew 'php70'
brew 'php70-pdo-pgsql'
brew 'php70-intl'
brew 'php71'
brew 'php71-pdo-pgsql'
brew 'php70-intl'
brew 'php-version'
brew 'terminal-parrot'
brew 'tig'
brew 'tmux'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'watch'
brew 'zsh'
brew 'zsh-completions'


# Apps
cask 'android-studio'
cask 'battle-net'
cask 'charles'
cask 'dashlane'
cask 'discord-ptb'
cask 'docker'
cask 'dropbox'
cask 'droplr'
cask 'firefoxdeveloperedition'
cask 'flash-npapi'
cask 'flash-ppapi'
cask 'flux-beta'
cask 'google-chrome-dev'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'gpgtools'
cask 'handbrake'
cask 'hazel'
cask 'imageoptim'
cask 'irccloud'
cask 'iswiff'
cask 'iterm2-beta'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'minikube'
cask 'mpv'
cask 'ngrok'
cask 'nosleep'
cask 'plex-media-player'
cask 'shimo'
cask 'sketch'
cask 'skype'
cask 'slack-beta'
cask 'sublime-text-dev'
cask 'synergy'
cask 'ubersicht'
cask 'vagrant'
cask 'visual-studio-code-insiders'
cask 'virtualbox'
cask 'vlc'
cask 'vmware-fusion'


# Mac App Store
mas 'Bear', id: 1091189122
mas 'DaisyDisk', id: 411643860
mas 'Irvue', id: 1039633667
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Marked', id: 890031187
mas 'Pages', id: 409201541
mas 'Pixelmator', id: 407963104


# Fonts
cask 'font-fira-code'
cask 'font-overpass'
cask 'font-roboto-slab'
cask 'font-source-code-pro'
